Revit 2026 API

# EnergyDataSettingsOutsideAirPerPerson Property

---

The rate of flow of outside air available per person.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OutsideAirPerPerson { get; set; }
```
```vb
Public Property OutsideAirPerPerson As Double
	Get
	Set
```
```cpp
public:
property double OutsideAirPerPerson {
	double get ();
	void set (double value);
}
```
```fsharp
member OutsideAirPerPerson : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The outside airPerPerson does not fall within an appropriate range. |

Stored in cubic feet per hour.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace